In [3]:
import pandas as pd

In [4]:
# Reading the CSV file into a DataFrame
car = pd.read_csv('car_price_dataset.csv')

# Displaying the first 5 rows of the dataset
car.head()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867

In [25]:
# Creating a DataFrame named 'unique' with a single column "Brand"
unique = pd.DataFrame(unique, columns=["Brand"])

# Getting the number of unique rows in the 'unique' DataFrame
unique.shape[0]

10

In [29]:
# Creating a DataFrame showing the count of missing values in each column
Check = pd.DataFrame(car.isna().sum())
Check

              0
Brand         0
Model         0
Year          0
Engine_Size   0
Fuel_Type     0
Transmission  0
Mileage       0
Doors         0
Owner_Count   0
Price         0

In [37]:
# Counting occurrences of each unique value in the 'Brand' column
Value_Counts = car['Brand'].value_counts()
print(Value_Counts.head())

Brand
Ford          1048
Audi          1038
Volkswagen    1020
Honda         1009
Chevrolet     1003
Name: count, dtype: int64

In [38]:
# Replacing 'Ford' with 'Ford Motors' in the 'Brand' column
car['Brand'] = car['Brand'].replace('Ford', 'Ford Motors')

In [48]:
# Grouping by 'Brand' and calculating the average 'Price' for each brand
fuel_type = car.groupby('Brand')['Price'].mean()
fuel_type

Brand
Audi           8929.373796
BMW            8704.068068
Chevrolet      9015.683948
Ford Motors    8852.570611
Honda          8665.596630
Hyundai        8778.279397
Kia            8880.086066
Mercedes       8980.087049
Toyota         8798.184536
Volkswagen     8928.377451
Name: Price, dtype: float64

In [65]:
# Creating a new column 'Price_Category' based on the 'Price' value
car['Price_Category'] = car['Price'].apply(lambda x: 'Expensive' if x > 30000 else 'Cheap')

# Displaying the first 5 values of the 'Price_Category' column
car['Price_Category'].head()

0    Cheap
1    Cheap
2    Cheap
3    Cheap
4    Cheap
Name: Price_Category, dtype: object

In [68]:
# Displaying unique values in the 'Model' column
car['Model'].unique()

array(['Rio', 'Malibu', 'GLA', 'Q5', 'Golf', 'Camry', 'Civic', 'Sportage',
       'RAV4', '5 Series', 'CR-V', 'Elantra', 'Tiguan', 'Equinox',
       'Explorer', 'A3', '3 Series', 'Tucson', 'Passat', 'Impala',
       'Corolla', 'Optima', 'Fiesta', 'A4', 'Focus', 'E-Class', 'Sonata',
       'C-Class', 'X5', 'Accord'], dtype=object)

In [73]:
# Function to categorize vehicles based on their model
def vechile_category(model):
    if model in ['Sportage', 'Tiguan', 'Sonata']:
        return 'SUV'
    elif model in ['Malibu', 'Camry', 'Civic', '5 Series', 'Elantra', 'Accord']:
        return 'Sedan'
    elif model in ['GLA', 'Q5', 'A3', '3 Series', 'X5', 'E-Class', 'C-Class']:
        return 'Luxury'
    else:
        return "Others"
# Applying the function to categorize each vehicle    
car["Category"] = car["Model"].apply(vechile_category)

# Displaying the first 5 rows of the 'Category' column
car["Category"].head()

# Displaying the first 5 rows of the updated dataset
car.head()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price,Price_Category,Category
0,Kia,Rio,2020,4.2,Diesel,Manual,289944,3,5,8501,Cheap,Others
1,Chevrolet,Malibu,2012,2.0,Hybrid,Automatic,5356,2,3,12092,Cheap,Sedan
2,Mercedes,GLA,2020,4.2,Diesel,Automatic,231440,4,2,11171,Cheap,Luxury
3,Audi,Q5,2023,2.0,Electric,Manual,160971,2,1,11780,Cheap,Luxury
4,Volkswagen,Golf,2003,2.6,Hybrid,Semi-Automatic,286618,3,3,2867,Cheap,Others

In [93]:
# Converting all values in the 'Brand' column to uppercase
car['Brand'].str.upper()

0               KIA
1         CHEVROLET
2          MERCEDES
3              AUDI
4        VOLKSWAGEN
           ...
9995            KIA
9996      CHEVROLET
9997            BMW
9998    FORD MOTORS
9999     VOLKSWAGEN
Name: Brand, Length: 10000, dtype: object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Brand           10000 non-null  object
 1   Model           10000 non-null  object
 2   Year            10000 non-null  int64
 3   Engine_Size     10000 non-null  float64
 4   Fuel_Type       10000 non-null  object
 5   Transmission    10000 non-null  object
 6   Mileage         10000 non-null  int64
 7   Doors           10000 non-null  int64
 8   Owner_Count     10000 non-null  int64
 9   Price           10000 non-null  int64
 10  Price_Category  10000 non-null  object
 11  Category        10000 non-null  object
dtypes: float64(1), int64(5), object(6)
memory usage: 937.6+ KB

In [102]:
# Filtering cars with a price greater than 50,000
expensive_cars = car[car['Price'] > 50000]
print(expensive_cars)

Empty DataFrame
Columns: [Brand, Model, Year, Engine_Size, Fuel_Type, Transmission, Mileage, Doors, Owner_Count, Price, Price_Category, Category]
Index: []

In [106]:
# Filtering the dataset for rows where 'Brand' is 'BMW'
filter_check = car[car['Brand'] == 'BMW']
filter_check.head()

,Brand,Model,Year,Engine_Size,Fuel_Type,Transmission,Mileage,Doors,Owner_Count,Price,Price_Category,Category
10,BMW,5 Series,2013,1.3,Hybrid,Automatic,296824,2,3,5863,Cheap,Sedan
27,BMW,3 Series,2017,2.3,Electric,Semi-Automatic,142701,5,3,10645,Cheap,Luxury
28,BMW,3 Series,2020,4.7,Electric,Semi-Automatic,210767,3,3,12584,Cheap,Luxury
41,BMW,5 Series,2007,4.9,Petrol,Manual,120491,2,1,8690,Cheap,Sedan
55,BMW,3 Series,2011,2.9,Electric,Semi-Automatic,281020,3,5,6679,Cheap,Luxury

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Brand         10000 non-null  object
 1   Model         10000 non-null  object
 2   Year          10000 non-null  int64
 3   Engine_Size   10000 non-null  float64
 4   Fuel_Type     10000 non-null  object
 5   Transmission  10000 non-null  object
 6   Mileage       10000 non-null  int64
 7   Doors         10000 non-null  int64
 8   Owner_Count   10000 non-null  int64
 9   Price         10000 non-null  int64
dtypes: float64(1), int64(5), object(4)
memory usage: 781.4+ KB

In [14]:
# Creating a pivot table to analyze 'Mileage' based on 'Brand' and 'Fuel_Type'
pivot1 = car.pivot_table(index = 'Brand', columns= 'Fuel_Type', values= 'Mileage', aggfunc= ['sum','mean'])
print(pivot1.head())

                sum                                         mean  \
Fuel_Type    Diesel  Electric    Hybrid    Petrol         Diesel
Brand
Audi       38634401  39913190  40640247  37523469  155783.875000
BMW        38874078  40845389  32701285  37409577  158669.706122
Chevrolet  39275620  35819238  36923770  35162468  151060.076923
Ford       39041748  42257488  38293899  38288370  147885.409091
Honda      37298676  43643608  35944929  36909506  150397.887097


Fuel_Type       Electric         Hybrid         Petrol
Brand
Audi       152340.419847  145143.739286  151304.310484
BMW        146399.243728  150697.165899  144998.360465
Chevrolet  143276.952000  143672.256809  148993.508475
Ford       152005.352518  148425.965116  154388.588710
Honda      164692.860377  140409.878906  153789.608333

In [5]:
# Calculating the average price of cars per brand
avg_price_by_brand = car.groupby('Brand')['Price'].mean()
print(avg_price_by_brand)

Brand
Audi          8929.373796
BMW           8704.068068
Chevrolet     9015.683948
Ford          8852.570611
Honda         8665.596630
Hyundai       8778.279397
Kia           8880.086066
Mercedes      8980.087049
Toyota        8798.184536
Volkswagen    8928.377451
Name: Price, dtype: float64

In [7]:
# Displaying the top 10 most expensive cars
top_expensive_cars = car.nlargest(10, 'Price')
print(top_expensive_cars)

          Brand     Model  Year  Engine_Size Fuel_Type Transmission  Mileage  \
1100     Toyota   Corolla  2021          4.7  Electric    Automatic    14924
7221       Audi        A3  2023          5.0    Hybrid    Automatic    12234
1012       Ford  Explorer  2020          4.8  Electric    Automatic    19112
9564      Honda    Accord  2022          4.0  Electric    Automatic    14658
5698      Honda      CR-V  2023          4.6    Hybrid    Automatic    10046
8422    Hyundai   Elantra  2019          4.6  Electric    Automatic     1406
9834     Toyota   Corolla  2022          3.6  Electric    Automatic     4015
2369  Chevrolet    Malibu  2022          4.1  Electric    Automatic    31949
9731        Kia       Rio  2023          4.2    Hybrid    Automatic     3490
6123   Mercedes   C-Class  2021          3.9  Electric    Automatic     9279

      Doors  Owner_Count  Price
1100      5            3  18301
7221      5            5  18255
1012      4            5  18017
9564      4            2  17906
5698      4            4  17899
8422      5            3  17871
9834      2            3  17719
2369      5            1  17661
9731      5            2  17630
6123      4            2  17614

In [8]:
# Filtering dataset for Petrol cars
petrol_cars = car[car['Fuel_Type'] == 'Petrol']
print(petrol_cars.head())

         Brand  Model  Year  Engine_Size Fuel_Type    Transmission  Mileage  \
5       Toyota  Camry  2007          2.7    Petrol       Automatic   157889
9       Toyota   RAV4  2005          3.1    Petrol          Manual   107724
14  Volkswagen   Golf  2003          2.4    Petrol       Automatic   145921
19    Mercedes    GLA  2021          1.5    Petrol          Manual    34640
24    Mercedes    GLA  2016          3.9    Petrol  Semi-Automatic    19868

    Doors  Owner_Count  Price
5       4            4   7242
9       2            5   6545
14      5            2   5981
19      2            1  11207
24      3            4  12402

In [9]:
# Checking how Mileage affects Price
mileage_price = car.groupby('Mileage')['Price'].mean()
print(mileage_price)

Mileage
25         9499.0
74         8998.0
88        10298.0
178       13196.0
184       13096.0
           ...
299714     4805.0
299754     7204.0
299818     6303.0
299872     7402.0
299947     7701.0
Name: Price, Length: 9854, dtype: float64

In [10]:
# Displaying the top 5 cars with the highest mileage
high_mileage_cars = car.nlargest(5, 'Mileage')
print(high_mileage_cars)

          Brand    Model  Year  Engine_Size Fuel_Type    Transmission  \
7838  Chevrolet  Equinox  2017          2.5  Electric          Manual
1339     Toyota     RAV4  2008          4.9  Electric  Semi-Automatic
3211      Honda   Accord  2012          3.6    Hybrid  Semi-Automatic
4929      Honda     CR-V  2016          4.3    Petrol  Semi-Automatic
4292       Audi       Q5  2015          2.2    Petrol          Manual

      Mileage  Doors  Owner_Count  Price
7838   299947      2            4   7701
1339   299872      5            5   7402
3211   299818      2            1   6303
4929   299754      2            2   7204
4292   299714      5            2   4805

In [11]:
# Checking price distribution
price_distribution = car['Price'].describe()
print(price_distribution)

count    10000.00000
mean      8852.96440
std       3112.59681
min       2000.00000
25%       6646.00000
50%       8858.50000
75%      11086.50000
max      18301.00000
Name: Price, dtype: float64

In [12]:
# Counting number of cars per fuel type
fuel_distribution = car['Fuel_Type'].value_counts()
print(fuel_distribution)

Fuel_Type
Electric    2625
Diesel      2512
Hybrid      2453
Petrol      2410
Name: count, dtype: int64